"""
4)	Программа принимает действительное положительное число x и целое отрицательное число y. 
Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y). 
При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **. 
Второй — более сложная реализация без оператора **, предусматривающая использование цикла.
"""


# def my_func(x, y):
#     print(x ** y)
#
#
# my_func(5, -7) # 1.28e-05
# my_func(4, -1) # 0.25

# без оператора ** нет мыслей как реализовать. ВОзможно стоит под учить математику 


#Solution from teacher


# def my_pow_func(x, y):
#     try:
#         ans = x ** y
#     except TypeError:
#         return 'Enter float'
#     return ans
#
# print(my_pow_func(10, -2))

def my_pow_func(x, y):
    try:
        x, y = float(x), int(y)
        res = x
        for i in range(abs(y) - 1):
            res *= x
        return 1 / res
    except ValueError:
        return 'Check value'





